BOOKS = [
    {
        'id': 1,
        'name': 'Структура и Интерпретация Компьютерных Программ',
        'name_eng': 'Structure and Interpretation of Computer Programs',
        'description': 'Книга посвящена описанию различных систем программного синтаксиса, анализу перехода от набора алгоритмов к программному коду. Значительное место уделяется обсуждению набора "элементарных программ", использующихся в качестве элементов конструкции программ более высоких уровней сложности, оптимизации соотношения их "веса" и эффективности. Особое внимание авторы уделяют анализу проблемы взаимодействия компьютера как физического объекта и программного кода, обеспечивающего информационную составляющую вычисления. Книга будет полезна всем, кому приходится иметь дело с программированием, в том числе и в гуманитарных областях знания.',
        'author': 'Харольд Абельсон, Джеральд Джей Сассман',
        'pages': 608,
        'pub_year': 2018,
        'is_available': True,
        'cover': 'books/sicp.jpg'
    },
    {
        'id': 2,
        'name': 'Изучаем Python',
        'name_eng': 'Learning Python',
        'description': 'Такие известные компании, как Google и Intel, Cisco и Hewlett-Packard, используют язык Python, выбрав его за гибкость, простоту использования и обеспечиваемую им высокую скорость разработки. Он позволяет создавать эффективные и надежные проекты, которые легко интегрируются с программами и инструментами, написанными на других языках.Четвертое издание «Изучаем Python» – это учебник, написанный доступным языком, рассчитанный на индивидуальную скорость обучения и основанный на материалах учебных курсов, которые автор, Марк Лутц, ведет уже на протяжении десяти лет. Издание значительно расширено и дополнено в соответствии с изменениями, появившимися в новой версии 3.0. В книге представлены основные типы объектов в языке Python, порядок их создания и работы с ними, а также функции как основной процедурный элемент языка. Рассматриваются методы работы с модулями и дополнительными объектно-ориентированными инструментами языка Python – классами. Включены описания моделей и инструкций обработки исключений, а также обзор инструментов разработки, используемых при создании крупных программ.Каждая глава завершается контрольными вопросами с ответами на закрепление пройденного материала, а каждая часть – упражнениями, решения которых приведены в приложении В. Книга была дополнена примечаниями о наиболее существенных расширениях языка, появившихся в версии Python 3.1.',
        'author': 'Марк Лутц',
        'pages': 1280,
        'pub_year': 2011,
        'is_available': True,
        'cover': 'books/lutz.png'
    },
    {
        'id': 3,
        'name': 'Новая большая книга CSS',
        'name_eng': 'CSS: The Missing Manual',
        'author': 'Дэвид Сойер Макфарланд',
        'description': 'Технология CSS3 позволяет создавать профессионально оформленные сайты, но тонкости этого языка могут оказаться довольно сложными даже для опытных веб-разработчиков. Полностью переработанное четвертое издание этой книги поможет вам поднять навыки работы с HTML и CSS на новый уровень; она содержит множество ценных советов, описаний приемов, а также инструкции, написанные в стиле справочного руководства. Веб-дизайнеры, как начинающие, так и опытные, при помощи этой книги быстро научатся создавать красивые веб-страницы, которые при этом молниеносно загружаются как на ПК, так и на мобильных устройствах.',
        'pages': 720,
        'pub_year': 2017,
        'is_available': False,
        'cover': 'books/css.jpg'
    },
    {
        'id': 4,
        'name': 'Совершенный код. Мастер-класс',
        'name_eng': 'Code Complete: Second Edition',
        'description': 'Более 10 лет первое издание этой книги считалось одним из лучших практических руководств по программированию. Сейчас эта книга полностью обновлена с учетом современных тенденций и технологий и дополнена сотнями новых примеров, иллюстрирующих искусство и науку программирования. Опираясь на академические исследования, с одной стороны, и практический опыт коммерческих разработок ПО - с другой, автор синтезировал из самых эффективных методик и наиболее эффективных принципов ясное прагматичное руководство. Каков бы ни был ваш профессиональный уровень, с какими бы средствами разработками вы ни работали, какова бы ни была сложность вашего проекта, в этой книге вы найдете нужную информацию, она заставит вас размышлять и поможет создать совершенный код. Книга состоит из 35 глав, предметного указателя и библиографии.',
        'author': 'Стив Макконнелл',
        'pages': 896,
        'pub_year': 2017,
        'is_available': True,
        'cover': 'books/code_completion.jpg'
    },
    {
        'id': 5,
        'name': 'Сборник задач и упражнений по математическому анализу',
        'name_eng': 'Collection of problems and exercises in mathematical analysis',
        'description': 'В сборник включено свыше 4000 задач и упражнений по важнейшим разделам математического анализа: введение в анализ; дифференциальное исчисление функций одной переменной; неопределенный и определенный интегралы; ряды; дифференциальное исчисление функций нескольких переменных; интегралы, зависящие от параметра; кратные и криволинейные интегралы. Ко всем задачам даны ответы. Для студентов физических и механико-математических специальностей высших учебных заведений.',
        'author': 'Борис Демидович',
        'pages': 560,
        'pub_year': 2006,
        'is_available': False,
        'cover': 'books/demidovich.jpg'
    }
]
